app/views/posts/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <%= f.label :author_id %><br>
    <%= f.select :author_id, options_for_select(@author_options, @post.author_id)  %>