app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def all
    @posts = Post.page(params[:page]).per(10).order("created_at DESC")

SELECT  "posts".* FROM "posts"  ORDER BY created_at DESC LIMIT 1
SELECT "posts".* FROM "posts"
---
  def index
    @post = Post.order("created_at DESC").first
    @posts = Post.all

INSERT INTO "posts" ("title", "body", "summary", "author_id", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "summary" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["summary", "What's Next"], ["updated_at", "2015-07-30 03:08:22.650059"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)